DamianPodrazaCode/ESP8266/SterownikPID_CaptivePortal_mDNS/src/main.cpp
/*
 * ============================================================
 * STEROWNIK PID - ESP8266 (ESP-07)
 * ============================================================
 * Wersja: 1.2 - Captive Portal + mDNS
 * ============================================================
 */

#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include <DNSServer.h>
#include <EEPROM.h>
#include <OneWire.h>
#include <DallasTemperature.h>

// ============================================================
// KONFIGURACJA PINÓW
// ============================================================
#define DS1_PIN 12
#define DS2_PIN 14
#define RESET_HW_PIN 13
#define FAN_PWM_PIN 5
#define PUMP_PIN 4

// ============================================================
// KONFIGURACJA EEPROM
// ============================================================
#define EEPROM_SIZE 512
#define ADDR_MAGIC 0
#define ADDR_SSID 4
#define ADDR_PASS 68
#define ADDR_TEMP_SETPOINT 132
#define ADDR_KP 136
#define ADDR_KI 140
#define ADDR_KD 144
#define EEPROM_MAGIC 0xA5B6C7D8

// ============================================================
// KONFIGURACJA DOMYŚLNA
// ============================================================
#define DEFAULT_SETPOINT 25.0
#define DEFAULT_KP 2.0
#define DEFAULT_KI 0.5
#define DEFAULT_KD 1.0
#define AP_SSID "Sterownik_PID"
#define AP_PASS "config1234"  // adres do AP "pid.pl"
#define MDNS_NAME "pid" // adres do STA "pid.local"
#define DNS_PORT 53

// ============================================================
// KONFIGURACJA PID I WYKRESU
// ============================================================
#define PID_INTERVAL_MS 500
#define PWM_FREQUENCY 1000
#define PWM_RANGE 1023
#define HISTORY_SIZE 60
#define HISTORY_INTERVAL_MS 2000

// ============================================================
// ZMIENNE GLOBALNE
// ============================================================
OneWire oneWire1(DS1_PIN);
OneWire oneWire2(DS2_PIN);
DallasTemperature sensor1(&oneWire1);
DallasTemperature sensor2(&oneWire2);

ESP8266WebServer server(80);
DNSServer dnsServer;

String wifiSSID = "";
String wifiPassword = "";
bool isAPMode = true;

float tempSetpoint = DEFAULT_SETPOINT;
float Kp = DEFAULT_KP;
float Ki = DEFAULT_KI;
float Kd = DEFAULT_KD;

bool pidRunning = false; 
float tempDS1 = 0.0;
float tempDS2 = 0.0;
int fanPWM = 0;
bool pumpState = false;

float pidIntegral = 0.0;
float pidPrevError = 0.0;
unsigned long pidLastTime = 0;

float tempHistory1[HISTORY_SIZE];
float tempHistory2[HISTORY_SIZE];
int historyIndex = 0;
unsigned long lastHistoryUpdate = 0;

unsigned long lastTempRead = 0;
unsigned long resetButtonPressTime = 0;

// ============================================================
// DEKLARACJE FUNKCJI (FORWARD DECLARATIONS)
// ============================================================
void setupWiFi();        // Ustawienie WiFi (AP lub STA)
void setupMDNS();        // Ustawienie mDNS
void checkResetButton(); // Sprawdzenie przycisku reset
void readTemperatures(); // Odczyt temperatur z czujników
void runPIDController(); // Sterowanie PID

void saveWiFiCredentials(); // Zapis danych WiFi do EEPROM
void loadWiFiCredentials(); // Odczyt danych WiFi z EEPROM
void saveSettings();        // Zapis ustawień PID do EEPROM
void loadSettings();        // Odczyt ustawień PID z EEPROM
void factoryReset();        // Przywrócenie ustawień fabrycznych

void handleAPConfig();      // Strona konfiguracji WiFi w trybie AP
void handleConnect();       // Obsługa formularza połączenia WiFi w trybie AP
void handleRoot();          // Strona główna w trybie STA
void handleAPI();           // API do odczytu danych
void handleSet();           // Ustawienie parametrów PID
void handleReset();         // Reset ustawień PID
void handleChart();         // Dane wykresu temperatur
void handleCaptivePortal(); // Obsługa żądań captive portal
void handleNotFound();      // Obsługa nieznanych żądań

// ============================================================
// SETUP
// ============================================================
void setup()
{
    Serial.begin(115200);
    Serial.println(F("\n\n=== STEROWNIK PID (damian.podraza@gmail.com) ==="));

    // Piny
    pinMode(RESET_HW_PIN, INPUT_PULLUP);
    pinMode(FAN_PWM_PIN, OUTPUT);
    pinMode(PUMP_PIN, OUTPUT);
    analogWriteFreq(PWM_FREQUENCY);
    analogWriteRange(PWM_RANGE);
    analogWrite(FAN_PWM_PIN, 0);
    digitalWrite(PUMP_PIN, LOW);

    // Czujniki
    sensor1.begin();
    sensor2.begin();
    sensor1.setResolution(12);
    sensor2.setResolution(12);
    sensor1.setWaitForConversion(false);
    sensor2.setWaitForConversion(false);

    EEPROM.begin(EEPROM_SIZE);

    // Reset podczas startu
    if (digitalRead(RESET_HW_PIN) == LOW)
    {
        Serial.println(F("Reset button pressed..."));
        delay(3000);
        if (digitalRead(RESET_HW_PIN) == LOW)
        {
            factoryReset();
        }
    }

    loadWiFiCredentials();
    setupWiFi();

    if (!isAPMode)
    {
        loadSettings();
        setupMDNS();
    }

    // Historia
    for (int i = 0; i < HISTORY_SIZE; i++)
    {
        tempHistory1[i] = 0;
        tempHistory2[i] = 0;
    }

    // Serwer WWW
    if (isAPMode)
    {
        // Captive Portal - obsługa wszystkich popularnych endpointów
        server.on("/", HTTP_GET, handleAPConfig);
        server.on("/connect", HTTP_POST, handleConnect);

        // Android captive portal detection
        server.on("/generate_204", HTTP_GET, handleCaptivePortal);
        server.on("/gen_204", HTTP_GET, handleCaptivePortal);

        // Apple captive portal detection
        server.on("/hotspot-detect.html", HTTP_GET, handleCaptivePortal);
        server.on("/library/test/success.html", HTTP_GET, handleCaptivePortal);
        server.on("/success.txt", HTTP_GET, handleCaptivePortal);

        // Windows captive portal detection
        server.on("/ncsi.txt", HTTP_GET, handleCaptivePortal);
        server.on("/connecttest.txt", HTTP_GET, handleCaptivePortal);
        server.on("/redirect", HTTP_GET, handleCaptivePortal);

        // Firefox captive portal detection
        server.on("/canonical.html", HTTP_GET, handleCaptivePortal);

