DamianPodrazaCode/ESP8266/SterownikPID_CaptivePortal_mDNS/src/main.cpp
        // Catch-all dla pozostałych zapytań
        server.onNotFound(handleNotFound);
    }
    else
    {
        server.on("/", HTTP_GET, handleRoot);
        server.on("/api", HTTP_GET, handleAPI);
        server.on("/set", HTTP_POST, handleSet);
        server.on("/reset", HTTP_POST, handleReset);
        server.on("/chart", HTTP_GET, handleChart);
        server.onNotFound([]()
                          { server.send(404, "text/plain", "Not Found"); });
    }
    server.begin();

    Serial.print(F("Free heap: "));
    Serial.println(ESP.getFreeHeap());
    Serial.println(F("System ready!"));
}

// ============================================================
// LOOP
// ============================================================
void loop()
{
    // Obsługa DNS w trybie AP (Captive Portal)
    if (isAPMode)
    {
        dnsServer.processNextRequest();
    }
    else
    {
        // Obsługa mDNS w trybie STA
        MDNS.update();
    }

    server.handleClient();
    checkResetButton();

    if (millis() - lastTempRead >= 1000)
    {
        readTemperatures();
        lastTempRead = millis();
    }

    if (millis() - lastHistoryUpdate >= HISTORY_INTERVAL_MS)
    {
        tempHistory1[historyIndex] = tempDS1;
        tempHistory2[historyIndex] = tempDS2;
        historyIndex = (historyIndex + 1) % HISTORY_SIZE;
        lastHistoryUpdate = millis();
    }

    if (pidRunning)
    {
        runPIDController();
    }

    // Wyjścia
    int pwmValue = map(fanPWM, 0, 100, 0, PWM_RANGE);
    analogWrite(FAN_PWM_PIN, pwmValue);
    digitalWrite(PUMP_PIN, (pidRunning && pumpState) ? HIGH : LOW);

    yield();
}

// ============================================================
// FUNKCJE SYSTEMOWE
// ============================================================
void setupWiFi()
{
    if (isAPMode)
    {
        WiFi.mode(WIFI_AP);
        WiFi.softAPConfig(
            IPAddress(192, 168, 4, 1),  // AP IP
            IPAddress(192, 168, 4, 1),  // Gateway
            IPAddress(255, 255, 255, 0) // Subnet
        );
        WiFi.softAP(AP_SSID, AP_PASS);

        // Uruchom serwer DNS dla Captive Portal
        // Przekieruj wszystkie domeny na IP AP
        dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
        dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());

        Serial.println(F("=== CAPTIVE PORTAL ACTIVE ==="));
        Serial.print(F("AP SSID: "));
        Serial.println(AP_SSID);
        Serial.print(F("AP Password: "));
        Serial.println(AP_PASS);
        Serial.print(F("AP IP: "));
        Serial.println(WiFi.softAPIP());
        Serial.println(F("DNS Server started - all domains redirect to AP"));
    }
    else
    {
        WiFi.mode(WIFI_STA);
        WiFi.begin(wifiSSID.c_str(), wifiPassword.c_str());

        Serial.print(F("Connecting to: "));
        Serial.println(wifiSSID);

        int attempts = 0;
        while (WiFi.status() != WL_CONNECTED && attempts < 40)
        {
            delay(500);
            Serial.print(".");
            attempts++;
        }

        if (WiFi.status() == WL_CONNECTED)
        {
            Serial.println(F("\n=== CONNECTED ==="));
            Serial.print(F("IP: "));
            Serial.println(WiFi.localIP());
        }
        else
        {
            Serial.println(F("\nConnection failed, switching to AP"));
            isAPMode = true;
            WiFi.mode(WIFI_AP);
            WiFi.softAPConfig(
                IPAddress(192, 168, 4, 1),
                IPAddress(192, 168, 4, 1),
                IPAddress(255, 255, 255, 0));
            WiFi.softAP(AP_SSID, AP_PASS);
            dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
            dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
        }
    }
}

void setupMDNS()
{
    if (MDNS.begin(MDNS_NAME))
    {
        MDNS.addService("http", "tcp", 80);
        Serial.println(F("=== mDNS ACTIVE ==="));
        Serial.print(F("Access via: http://"));
        Serial.print(MDNS_NAME);
        Serial.println(F(".local"));
    }
    else
    {
        Serial.println(F("mDNS failed to start"));
    }
}

void checkResetButton()
{
    if (digitalRead(RESET_HW_PIN) == LOW)
    {
        if (resetButtonPressTime == 0)
        {
            resetButtonPressTime = millis();
        }
        else if (millis() - resetButtonPressTime > 5000)
        {
            factoryReset();
        }
    }
    else
    {
        resetButtonPressTime = 0;
    }
}

void readTemperatures()
{
    sensor1.requestTemperatures();
    sensor2.requestTemperatures();

    float t1 = sensor1.getTempCByIndex(0);
    float t2 = sensor2.getTempCByIndex(0);

    if (t1 != DEVICE_DISCONNECTED_C && t1 > -50 && t1 < 150)
        tempDS1 = t1;
    if (t2 != DEVICE_DISCONNECTED_C && t2 > -50 && t2 < 150)
        tempDS2 = t2;
}

void runPIDController()
{
    unsigned long now = millis();
    if (now - pidLastTime < PID_INTERVAL_MS)
        return;

    float dt = (now - pidLastTime) / 1000.0;
    pidLastTime = now;

    float error = tempDS1 - tempSetpoint;

    if (error <= 0)
    {
        pidIntegral = 0;
        pidPrevError = 0;
        fanPWM = 0;
        return;
    }

    float P = Kp * error;
    pidIntegral += error * dt;
    if (Ki > 0)
        pidIntegral = constrain(pidIntegral, 0, 100.0 / Ki);
    float I = Ki * pidIntegral;
    float D = Kd * (error - pidPrevError) / dt;
    pidPrevError = error;

    float output = P + I + D;
    fanPWM = constrain((int)output, 0, 100);
}

// ============================================================
// EEPROM
// ============================================================
void saveWiFiCredentials()
{
    uint32_t magic = EEPROM_MAGIC;
    EEPROM.put(ADDR_MAGIC, magic);

    for (unsigned int i = 0; i < 64; i++)
    {
        EEPROM.write(ADDR_SSID + i, (i < wifiSSID.length()) ? wifiSSID[i] : 0);
        EEPROM.write(ADDR_PASS + i, (i < wifiPassword.length()) ? wifiPassword[i] : 0);
    }
    EEPROM.commit();
}

void loadWiFiCredentials()
{
    uint32_t magic;
    EEPROM.get(ADDR_MAGIC, magic);

    if (magic != EEPROM_MAGIC)
    {
        isAPMode = true;
        return;
    }

    char buf[65];
    for (int i = 0; i < 64; i++)
        buf[i] = EEPROM.read(ADDR_SSID + i);
    buf[64] = 0;
    wifiSSID = String(buf);

    for (int i = 0; i < 64; i++)
        buf[i] = EEPROM.read(ADDR_PASS + i);
    buf[64] = 0;
    wifiPassword = String(buf);

    isAPMode = false;
}

void saveSettings()
{
    EEPROM.put(ADDR_TEMP_SETPOINT, tempSetpoint);
    EEPROM.put(ADDR_KP, Kp);
    EEPROM.put(ADDR_KI, Ki);
    EEPROM.put(ADDR_KD, Kd);
    EEPROM.commit();
}

