DamianPodrazaCode/ESP8266/SterownikPID_CaptivePortal_mDNS/src/main.cpp
void loadSettings()
{
    float temp;
    EEPROM.get(ADDR_TEMP_SETPOINT, temp);
    tempSetpoint = (!isnan(temp) && temp >= -50 && temp <= 150) ? temp : DEFAULT_SETPOINT;

    EEPROM.get(ADDR_KP, temp);
    Kp = (!isnan(temp) && temp >= 0 && temp <= 1000) ? temp : DEFAULT_KP;

    EEPROM.get(ADDR_KI, temp);
    Ki = (!isnan(temp) && temp >= 0 && temp <= 1000) ? temp : DEFAULT_KI;

    EEPROM.get(ADDR_KD, temp);
    Kd = (!isnan(temp) && temp >= 0 && temp <= 1000) ? temp : DEFAULT_KD;
}

void factoryReset()
{
    Serial.println(F("FACTORY RESET!"));
    for (int i = 0; i < EEPROM_SIZE; i++)
        EEPROM.write(i, 0xFF);
    EEPROM.commit();
    analogWrite(FAN_PWM_PIN, 0);
    digitalWrite(PUMP_PIN, LOW);
    delay(1000);
    ESP.restart();
}

// ============================================================
// CAPTIVE PORTAL HANDLERS
// ============================================================
void handleCaptivePortal()
{
    Serial.print(F("Captive portal request: "));
    Serial.println(server.uri());

    // Przekieruj na stronę konfiguracji
    server.sendHeader("Location", String("http://") + WiFi.softAPIP().toString(), true);
    server.send(302, "text/plain", "");
}

void handleNotFound()
{
    // Sprawdź czy to żądanie do naszego IP
    String host = server.hostHeader();

    Serial.print(F("Not found: "));
    Serial.print(host);
    Serial.println(server.uri());

    // Jeśli host nie jest naszym IP - przekieruj (captive portal)
    if (host != WiFi.softAPIP().toString())
    {
        handleCaptivePortal();
        return;
    }

    // W przeciwnym razie pokaż stronę konfiguracji
    handleAPConfig();
}

// ============================================================
// HANDLERY WWW - AP MODE
// ============================================================
void handleAPConfig()
{
    String html = F("<!DOCTYPE html><html><head><meta charset='UTF-8'>"
                    "<meta name='viewport' content='width=device-width,initial-scale=1'>"
                    "<title>Sterownik PID - WiFi</title><style>"
                    "body{font-family:Arial;background:#1a1a2e;color:#fff;display:flex;"
                    "justify-content:center;align-items:center;min-height:100vh;margin:0;padding:20px;}"
                    ".box{background:#16213e;padding:40px;border-radius:20px;text-align:center;max-width:350px;width:100%;}"
                    "h1{color:#e94560;margin-bottom:10px;font-size:1.8em;}h3{color:#4ecca3;margin-bottom:30px;}"
                    ".info{background:#0f3460;padding:15px;border-radius:10px;margin-bottom:20px;font-size:0.9em;}"
                    ".info p{margin:5px 0;color:#888;}"
                    ".info span{color:#4ecca3;}"
                    "input{width:100%;padding:15px;margin:10px 0;border:2px solid #0f3460;"
                    "border-radius:10px;background:#0f3460;color:#fff;font-size:16px;box-sizing:border-box;}"
                    "input:focus{outline:none;border-color:#4ecca3;}"
                    "input::placeholder{color:#666;}"
                    "button{width:100%;padding:15px;margin-top:20px;background:#4ecca3;color:#1a1a2e;"
                    "border:none;border-radius:10px;font-size:18px;font-weight:bold;cursor:pointer;}"
                    "button:hover{background:#3db892;}"
                    ".footer{margin-top:20px;color:#555;font-size:0.8em;}"
                    "</style></head><body><div class='box'>"
                    "<h1>Konfiguracja WiFi</h1>"
                    "<form action='/connect' method='POST'>"
                    "<input type='text' name='ssid' placeholder='&#128246; Nazwa sieci WiFi' required autocomplete='off'>"
                    "<input type='password' name='pass' placeholder='&#128274; Haslo sieci' required autocomplete='off'>"
                    "<button type='submit'>&#10004; Polacz</button></form>"
                    "</div></body></html>");

    server.send(200, "text/html", html);
}

void handleConnect()
{
    wifiSSID = server.arg("ssid");
    wifiPassword = server.arg("pass");
    saveWiFiCredentials();

    String html = F("<!DOCTYPE html><html><head><meta charset='UTF-8'>"
                    "<meta name='viewport' content='width=device-width,initial-scale=1'>"
                    "<title>Laczenie...</title><style>"
                    "body{font-family:Arial;background:#1a1a2e;color:#fff;display:flex;"
                    "justify-content:center;align-items:center;min-height:100vh;margin:0;}"
                    ".box{background:#16213e;padding:40px;border-radius:20px;text-align:center;max-width:400px;}"
                    "h2{color:#4ecca3;margin-bottom:20px;}"
                    ".spinner{width:50px;height:50px;border:4px solid #0f3460;border-top:4px solid #4ecca3;"
                    "border-radius:50%;animation:spin 1s linear infinite;margin:20px auto;}"
                    "@keyframes spin{100%{transform:rotate(360deg);}}"
                    ".info{background:#0f3460;padding:15px;border-radius:10px;margin-top:20px;text-align:left;}"
                    ".info p{margin:8px 0;font-size:0.9em;}"
                    ".info span{color:#4ecca3;}"
                    "</style></head><body><div class='box'>"
                    "<h2>&#10004; Dane zapisane!</h2>"
                    "<div class='spinner'></div>"
                    "<p>Urzadzenie uruchomi sie ponownie<br>i polaczy z siecia WiFi...</p>"
                    "<div class='info'>"
                    "<p>&#128246; Siec: <span>");
    html += wifiSSID;
    html += F("</span></p>"
              "<p>&#127760; Adres: <span>http://pid.local</span></p>"
              "<p style='color:#888;font-size:0.85em;'>lub sprawdz IP w routerze</p>"
              "</div></div></body></html>");

    server.send(200, "text/html", html);
    delay(2000);
    ESP.restart();
}

// ============================================================
// HANDLERY WWW - NORMAL MODE
// ============================================================
void handleAPI()
{
    String json = "{\"ds1\":" + String(tempDS1, 2) +
                  ",\"ds2\":" + String(tempDS2, 2) +
                  ",\"fan\":" + String(fanPWM) +
                  ",\"pump\":" + String(pumpState ? "true" : "false") +
                  ",\"setpoint\":" + String(tempSetpoint, 1) +
                  ",\"kp\":" + String(Kp, 2) +
                  ",\"ki\":" + String(Ki, 2) +
                  ",\"kd\":" + String(Kd, 2) +
                  ",\"running\":" + String(pidRunning ? "true" : "false") +
                  ",\"ip\":\"" + WiFi.localIP().toString() + "\"" +
                  ",\"mdns\":\"" + String(MDNS_NAME) + ".local\"}";
    server.send(200, "application/json", json);
}

void handleSet()
{
    bool settingsChanged = false;

    if (server.hasArg("running"))
    {
        bool newState = (server.arg("running") == "1");
        if (newState != pidRunning)
        {
            pidRunning = newState;
            if (pidRunning)
            {
                pumpState = true;
                pidIntegral = 0;
                pidPrevError = 0;
                pidLastTime = millis();
            }
            else
            {
                pumpState = false;
                fanPWM = 0;
                analogWrite(FAN_PWM_PIN, 0);
                digitalWrite(PUMP_PIN, LOW);
            }
        }
    }

    if (server.hasArg("setpoint"))
    {
        float v = server.arg("setpoint").toFloat();
        if (v >= -50 && v <= 150)
        {
            tempSetpoint = v;
            settingsChanged = true;
        }
    }
    if (server.hasArg("kp"))
    {
        float v = server.arg("kp").toFloat();
        if (v >= 0 && v <= 1000)
        {
            Kp = v;
            settingsChanged = true;
        }
    }
    if (server.hasArg("ki"))
    {
        float v = server.arg("ki").toFloat();
        if (v >= 0 && v <= 1000)
        {
            Ki = v;
            pidIntegral = 0;
            settingsChanged = true;
        }
    }
    if (server.hasArg("kd"))
    {
        float v = server.arg("kd").toFloat();
        if (v >= 0 && v <= 1000)
        {
            Kd = v;
            settingsChanged = true;
        }
    }

    if (settingsChanged)
        saveSettings();
    server.send(200, "text/plain", "OK");
}

void handleReset()
{
    server.send(200, "text/plain", "Resetting...");
    delay(500);
    factoryReset();
}

void handleChart()
{
    String json = "{\"ds1\":[";
    for (int i = 0; i < HISTORY_SIZE; i++)
    {
        int idx = (historyIndex + i) % HISTORY_SIZE;
        if (i > 0)
            json += ",";
        json += String(tempHistory1[idx], 1);
    }
    json += "],\"ds2\":[";
    for (int i = 0; i < HISTORY_SIZE; i++)
    {
        int idx = (historyIndex + i) % HISTORY_SIZE;
        if (i > 0)
            json += ",";
        json += String(tempHistory2[idx], 1);
    }
    json += "],\"sp\":" + String(tempSetpoint, 1) + "}";
    server.send(200, "application/json", json);
}

