DamianPodrazaCode/ESP8266/SterownikPID_CaptivePortal_mDNS/src/main.cpp
// ============================================================
// STRONA GŁÓWNA - CSS
// ============================================================
const char CSS_PART[] PROGMEM = R"(<!DOCTYPE html><html><head><meta charset='UTF-8'>
<meta name='viewport' content='width=device-width,initial-scale=1'>
<title>Sterownik PID</title><style>
*{box-sizing:border-box;margin:0;padding:0}
body{font-family:Arial;background:#1a1a2e;color:#fff;padding:15px}
.c{max-width:800px;margin:0 auto}
h1{text-align:center;color:#e94560;font-size:1.8em;margin-bottom:20px}
.p{background:#16213e;border-radius:12px;padding:20px;margin-bottom:15px}
.pt{color:#4ecca3;font-size:1.1em;margin-bottom:15px;border-bottom:1px solid #0f3460;padding-bottom:10px}
.row{display:flex;flex-wrap:wrap;gap:10px;align-items:center}
.btn{padding:12px 25px;border:none;border-radius:8px;cursor:pointer;font-size:16px;font-weight:bold}
.bon{background:#4ecca3;color:#1a1a2e}.bof{background:#e94560;color:#fff}
.bon.a{box-shadow:0 0 15px #4ecca3}.bof.a{box-shadow:0 0 15px #e94560}
input[type=number]{background:#0f3460;border:2px solid #4ecca3;border-radius:6px;
padding:10px;color:#fff;font-size:14px;width:80px;text-align:center}
input:focus{outline:none;border-color:#e94560}
label{color:#4ecca3;font-weight:bold;min-width:70px}
.u{color:#888;font-size:12px}
.ig{display:flex;align-items:center;gap:8px}
.grid{display:grid;grid-template-columns:repeat(auto-fit,minmax(150px,1fr));gap:15px}
.box{background:#0f3460;border-radius:10px;padding:15px;text-align:center}
.box .ic{font-size:1.8em;margin-bottom:8px}
.box .lb{color:#888;font-size:0.85em;margin-bottom:5px}
.box .vl{font-size:1.6em;font-weight:bold;color:#4ecca3}
.vl.r{color:#e94560}.vl.g{color:#4ecca3}.vl.y{color:#ffc107}
.st{padding:6px 15px;border-radius:15px;font-size:12px;font-weight:bold}
.st.on{background:#4ecca3;color:#1a1a2e}.st.of{background:#e94560;color:#fff}
.ch{background:#0f3460;border-radius:10px;height:200px;position:relative}
.lg{display:flex;justify-content:center;gap:20px;margin-bottom:10px;font-size:12px}
.lg span{display:flex;align-items:center;gap:5px}
.lg i{display:inline-block;width:15px;height:3px;border-radius:2px}
.l1{background:#4ecca3}.l2{background:#e94560}.l3{background:#ffc107}
canvas{width:100%!important;height:170px!important}
.br{width:100%;padding:15px;background:linear-gradient(135deg,#ff6b35,#e94560);
color:#fff;border:none;border-radius:8px;font-size:16px;font-weight:bold;cursor:pointer}
.br:hover{opacity:0.9}
.ft{text-align:center;color:#555;padding:15px;font-size:0.85em}
.nfo{background:#0f3460;padding:10px 15px;border-radius:8px;margin-top:10px;font-size:0.85em;color:#888}
.nfo span{color:#4ecca3}
</style></head>)";

// ============================================================
// STRONA GŁÓWNA - HTML BODY
// ============================================================
const char HTML_BODY[] PROGMEM = R"(<body><div class='c'>
<h1>&#127777; Sterownik PID</h1>
<div class='p'><div class='row'>
<button class='btn bon' id='bo' onclick='sp(1)'>ON</button>
<button class='btn bof a' id='bf' onclick='sp(0)'>OFF</button>
<div class='ig'><label>Temp:</label>
<input type='number' id='st' step='0.5' value='25' onchange='ss()'>
<span class='u'>C</span></div>
<span class='st of' id='ss'>OFF</span>
</div></div>
<div class='p'><div class='pt'>Nastawy PID</div>
<div class='grid'>
<div class='box'><div class='lb'>Kp</div>
<input type='number' id='kp' step='0.1' value='2' onchange='su()'></div>
<div class='box'><div class='lb'>Ki</div>
<input type='number' id='ki' step='0.01' value='0.5' onchange='su()'></div>
<div class='box'><div class='lb'>Kd</div>
<input type='number' id='kd' step='0.01' value='1' onchange='su()'></div>
</div></div>
<div class='p'><div class='pt'>Odczyty</div>
<div class='grid'>
<div class='box'><div class='ic'>&#127777;</div><div class='lb'>DS1 (PID)</div>
<div class='vl' id='d1'>--</div></div>
<div class='box'><div class='ic'>&#127777;</div><div class='lb'>DS2</div>
<div class='vl' id='d2'>--</div></div>
<div class='box'><div class='ic'>&#128168;</div><div class='lb'>Wentylator</div>
<div class='vl' id='fn'>--%</div></div>
<div class='box'><div class='ic'>&#128167;</div><div class='lb'>Pompa</div>
<div class='vl' id='pm'>--</div></div>
</div></div>
<div class='p'><div class='pt'>Wykres</div>
<div class='ch'><div class='lg'>
<span><i class='l1'></i>DS1</span>
<span><i class='l2'></i>DS2</span>
<span><i class='l3'></i>SP</span></div>
<canvas id='cv'></canvas></div></div>
<div class='p'>
<button class='br' onclick='rs()'>RESET FABRYCZNY</button>
<p style='text-align:center;color:#888;margin-top:10px;font-size:0.85em'>
Przytrzymaj RESET_HW 5s lub kliknij powyzej</p>
<div class='nfo'>IP: <span id='ip'>--</span> | mDNS: <span id='mdns'>--</span></div>
</div>
<div class='ft'>Sterownik PID (damian.podraza@gmail.com)</div></div>)";

// ============================================================
// STRONA GŁÓWNA - JAVASCRIPT
// ============================================================
const char JS_PART[] PROGMEM = R"(<script>
var c1=[],c2=[],csp=25,cv,cx;
window.onload=function(){
cv=document.getElementById('cv');
cx=cv.getContext('2d');
rs2();window.addEventListener('resize',rs2);
gd();gc();setInterval(gd,1500);setInterval(gc,5000);};

function rs2(){var p=cv.parentElement;
cv.width=p.clientWidth-20;cv.height=160;dc();}

function gd(){fetch('/api').then(r=>r.json()).then(d=>{
document.getElementById('d1').innerText=d.ds1.toFixed(1)+'C';
document.getElementById('d2').innerText=d.ds2.toFixed(1)+'C';
document.getElementById('fn').innerText=d.fan+'%';
var pm=document.getElementById('pm');
pm.innerText=d.pump?'ON':'OFF';
pm.className='vl '+(d.pump?'g':'r');
if(document.activeElement.id!='st')document.getElementById('st').value=d.setpoint;
if(document.activeElement.id!='kp')document.getElementById('kp').value=d.kp;
if(document.activeElement.id!='ki')document.getElementById('ki').value=d.ki;
if(document.activeElement.id!='kd')document.getElementById('kd').value=d.kd;
csp=d.setpoint;
var bo=document.getElementById('bo'),bf=document.getElementById('bf'),
ss=document.getElementById('ss');
if(d.running){bo.className='btn bon a';bf.className='btn bof';
ss.innerText='AKTYWNY';ss.className='st on';}
else{bo.className='btn bon';bf.className='btn bof a';
ss.innerText='OFF';ss.className='st of';}
var d1=document.getElementById('d1');
d1.className='vl '+(d.ds1>d.setpoint+5?'r':(d.ds1>d.setpoint?'y':'g'));
if(d.ip)document.getElementById('ip').innerText=d.ip;
if(d.mdns)document.getElementById('mdns').innerText=d.mdns;
}).catch(e=>console.log(e));}

