DamianPodrazaCode/ESP8266/SterownikPID_CaptivePortal_mDNS/src/main.cpp
function gc(){fetch('/chart').then(r=>r.json()).then(d=>{
c1=d.ds1;c2=d.ds2;csp=d.sp;dc();}).catch(e=>console.log(e));}

function dc(){if(!cx||c1.length<2)return;
var w=cv.width,h=cv.height,pl=40,pr=10,pt=10,pb=20;
var cw=w-pl-pr,ch=h-pt-pb;
cx.clearRect(0,0,w,h);
var all=c1.concat(c2).concat([csp]).filter(v=>v!=0&&!isNaN(v));
if(all.length==0)return;
var mn=Math.min.apply(null,all)-2,mx=Math.max.apply(null,all)+2,rg=mx-mn||1;
cx.strokeStyle='#1a3a5c';cx.lineWidth=1;cx.fillStyle='#666';cx.font='10px Arial';
for(var i=0;i<=4;i++){var y=pt+ch*i/4,v=mx-rg*i/4;
cx.beginPath();cx.moveTo(pl,y);cx.lineTo(w-pr,y);cx.stroke();
cx.fillText(v.toFixed(1),2,y+3);}
function gy(v){return pt+ch*(1-(v-mn)/rg);}
function gx(i){return pl+cw*i/(c1.length-1);}
cx.strokeStyle='#ffc107';cx.lineWidth=1;cx.setLineDash([4,4]);
cx.beginPath();var sy=gy(csp);cx.moveTo(pl,sy);cx.lineTo(w-pr,sy);cx.stroke();
cx.setLineDash([]);
cx.strokeStyle='#4ecca3';cx.lineWidth=2;cx.beginPath();var st=0;
c1.forEach(function(v,i){if(v==0)return;var x=gx(i),y=gy(v);
if(!st){cx.moveTo(x,y);st=1;}else cx.lineTo(x,y);});cx.stroke();
cx.strokeStyle='#e94560';cx.lineWidth=2;cx.beginPath();st=0;
c2.forEach(function(v,i){if(v==0)return;var x=gx(i),y=gy(v);
if(!st){cx.moveTo(x,y);st=1;}else cx.lineTo(x,y);});cx.stroke();}

function sp(o){fetch('/set',{method:'POST',
headers:{'Content-Type':'application/x-www-form-urlencoded'},
body:'running='+(o?'1':'0')}).then(()=>gd());}

function ss(){var v=document.getElementById('st').value;
fetch('/set',{method:'POST',
headers:{'Content-Type':'application/x-www-form-urlencoded'},
body:'setpoint='+v});}

function su(){var kp=document.getElementById('kp').value,
ki=document.getElementById('ki').value,
kd=document.getElementById('kd').value;
fetch('/set',{method:'POST',
headers:{'Content-Type':'application/x-www-form-urlencoded'},
body:'kp='+kp+'&ki='+ki+'&kd='+kd});}

function rs(){if(confirm('Reset fabryczny?')){
fetch('/reset',{method:'POST'}).then(()=>{
alert('Urzadzenie restartuje...');});}}
</script></body></html>)";

// ============================================================
// STRONA GŁÓWNA - wysyłana w częściach z PROGMEM
// ============================================================
void handleRoot()
{
    server.setContentLength(CONTENT_LENGTH_UNKNOWN);
    server.send(200, "text/html", "");

    server.sendContent_P(CSS_PART);
    server.sendContent_P(HTML_BODY);
    server.sendContent_P(JS_PART);
}